app/services/geracao_escala_service.rb

  def gerar!
    EventoEscala.transaction do
      @competencia.evento_escalas.ordinarios.destroy_all
---
DELETE FROM "evento_escala" WHERE "evento_escala"."id" = $1  [["id", 100]]

  def criar_eventos
    (1..@competencia.periodo_fim.day).each do |dia|
      data = Date.new(@competencia.ano, @competencia.mes, dia)
      CalendarioBase.ativos.por_dia(data.wday).each do |cb|
        tipo_servico = tipo_servico_para(cb.tipo.to_s)
        next unless tipo_servico

        valor = cb.valor_esportula_override.presence || cb.sacerdote&.valor_esportula_padrao

        @competencia.evento_escalas.create!(
          tipo_servico_id: tipo_servico.id,
          data: data,
          horario: cb.horario,
          quantidade_ministros: cb.quantidade_ministros,
          sacerdote_id: cb.sacerdote_id,
          valor_esportula: valor,
          tipo_escala: "ordinaria",
          status: "pendente"
        )
---
INSERT INTO "evento_escala" ("competencia_mensal_id", "tipo_servico_id", "data", "horario", "quantidade_ministros", "local", "descricao", "observacoes", "sacerdote_id", "valor_esportula", "equipe_id", "tipo_escala", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def tipo_servico_para(tipo)
    tipo_str = tipo.to_s.downcase.strip
    attrs = TIPO_PARA_NOME[tipo_str]
    return nil unless attrs

    ts = TipoServico.find_or_initialize_by(nome: attrs[:nome])
---
SELECT "tipo_servicos".* FROM "tipo_servicos" WHERE "tipo_servicos"."nome" = $1 LIMIT $2  [["nome", "Missa"], ["LIMIT", 1]]