lib/tasks/debug_escala.rake

  task debug: :environment do
    puts "\n=== Calendário Base por tipo ==="
    CalendarioBase.ativos.group(:tipo).count.each do |tipo, count|
      puts "  #{tipo}: #{count} entradas"
    end

    puts "\n=== TipoServico Confissão ==="
    ts = TipoServico.find_by(nome: "Confissão")
    if ts
      puts "  Encontrado: id=#{ts.id}, ativo=#{ts.ativo}"
    else
      puts "  NÃO ENCONTRADO - será criado na próxima geração"
    end

    puts "\n=== Última competência - evento_escalas por tipo_servico ==="
    comp = CompetenciaMensal.ordenados.first
    return puts "  Nenhuma competência" unless comp

    comp.evento_escalas.joins(:tipo_servico).group("tipo_servicos.nome").count.each do |nome, count|
---
SELECT COUNT(*) AS "count_all", "calendario_base"."tipo" AS "calendario_base_tipo" FROM "calendario_base" WHERE "calendario_base"."ativo" = $1 GROUP BY "calendario_base"."tipo"  [["ativo", true]]
SELECT "tipo_servicos".* FROM "tipo_servicos" WHERE "tipo_servicos"."nome" = $1 LIMIT $2  [["nome", "Confissão"], ["LIMIT", 1]]
SELECT COUNT(*) AS "count_all", "tipo_servicos"."nome" AS "tipo_servicos_nome" FROM "evento_escala" INNER JOIN "tipo_servicos" ON "tipo_servicos"."id" = "evento_escala"."tipo_servico_id" WHERE "evento_escala"."competencia_mensal_id" = $1 GROUP BY "tipo_servicos"."nome"  [["competencia_mensal_id", 2]]