app/views/admin/equipes/index.html.erb

SELECT COUNT(*) FROM "ministros" INNER JOIN "equipe_ministros" ON "ministros"."id" = "equipe_ministros"."ministro_id" WHERE "equipe_ministros"."equipe_id" = $1  [["equipe_id", 1]]
---
            </td>
            <td class="px-6 py-4 text-sm text-stone-600"><%= equipe.ministros.count %> ministros</td>