app/views/admin/equipes/show.html.erb

        <dt class="text-sm font-medium text-stone-500">Ministros</dt>
        <dd class="mt-1 text-stone-800"><%= @equipe.ministros.count %></dd>
---
SELECT "ministros".* FROM "ministros" INNER JOIN "equipe_ministros" ON "ministros"."id" = "equipe_ministros"."ministro_id" WHERE "equipe_ministros"."equipe_id" = $1  [["equipe_id", 3]]
SELECT COUNT(*) FROM "ministros" INNER JOIN "equipe_ministros" ON "ministros"."id" = "equipe_ministros"."ministro_id" WHERE "equipe_ministros"."equipe_id" = $1  [["equipe_id", 3]]


    <% if @equipe.ministros.any? %>
---
SELECT 1 AS one FROM "ministros" INNER JOIN "equipe_ministros" ON "ministros"."id" = "equipe_ministros"."ministro_id" WHERE "equipe_ministros"."equipe_id" = $1 LIMIT $2  [["equipe_id", 3], ["LIMIT", 1]]
SELECT "ministros".* FROM "ministros" INNER JOIN "equipe_ministros" ON "ministros"."id" = "equipe_ministros"."ministro_id" WHERE "equipe_ministros"."equipe_id" = $1  [["equipe_id", 3]]