app/controllers/admin/calendario_base_controller.rb

SELECT "calendario_base".* FROM "calendario_base" WHERE "calendario_base"."ativo" = $1 ORDER BY "calendario_base"."dia_da_semana" ASC, "calendario_base"."horario" ASC  [["ativo", true]]
---
    def index
      @calendario_base = CalendarioBase.ativos.order(:dia_da_semana, :horario)

INSERT INTO "calendario_base" ("dia_da_semana", "horario", "quantidade_ministros", "sacerdote_id", "valor_esportula_override", "ativo", "observacoes", "created_at", "updated_at", "tipo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
    def create
      @calendario_base = CalendarioBase.new(calendario_base_params)
      if @calendario_base.save

UPDATE "calendario_base" SET "horario" = $1, "sacerdote_id" = $2, "observacoes" = $3, "updated_at" = $4 WHERE "calendario_base"."id" = $5  [["horario", "09:00:00"], ["sacerdote_id", 3], ["observacoes", ""], ["updated_at", "2026-03-19 23:22:41.622610"], ["id", 3]]
---
    def update
      if @calendario_base.update(calendario_base_params)

DELETE FROM "calendario_base" WHERE "calendario_base"."id" = $1  [["id", 19]]
---
    def destroy
      @calendario_base.destroy

SELECT "calendario_base".* FROM "calendario_base" WHERE "calendario_base"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_calendario_base
      @calendario_base = CalendarioBase.find(params[:id])