app/controllers/admin/competencia_mensal_controller.rb

SELECT 1 AS one FROM "competencia_mensal" WHERE "competencia_mensal"."mes" = $1 AND "competencia_mensal"."ano" = $2 LIMIT $3  [["mes", 3], ["ano", 2026], ["LIMIT", 1]]
SELECT "competencia_mensal".* FROM "competencia_mensal" ORDER BY "competencia_mensal"."ano" DESC, "competencia_mensal"."mes" DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
      @competencias = CompetenciaMensal.ordenados

      @competencias = @competencias.where(ano: params[:ano]) if params[:ano].present?
      @competencias = @competencias.where(mes: params[:mes]) if params[:mes].present?
      @competencias = @competencias.where(escala_gerada: params[:escala_gerada]) if params[:escala_gerada].present?

      @competencias = @competencias.page(params[:page])

SELECT "evento_escala".* FROM "evento_escala" WHERE "evento_escala"."competencia_mensal_id" = $1 AND "evento_escala"."tipo_servico_id" = $2  [["competencia_mensal_id", 2], ["tipo_servico_id", 8]]
SELECT "sacerdotes".* FROM "sacerdotes" WHERE "sacerdotes"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 1], ["id", 2], ["id", 6], ["id", 7], ["id", 3], ["id", 5]]
SELECT "tipo_servicos".* FROM "tipo_servicos" WHERE "tipo_servicos"."id" IN ($1, $2)  [["id", 1], ["id", 8]]
SELECT 1 AS one FROM "evento_escala" WHERE "evento_escala"."competencia_mensal_id" = $1 LIMIT $2  [["competencia_mensal_id", 1], ["LIMIT", 1]]
SELECT "sacerdotes".* FROM "sacerdotes" WHERE "sacerdotes"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "tipo_servicos".* FROM "tipo_servicos" WHERE "tipo_servicos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "escala_ministros".* FROM "escala_ministros" WHERE "escala_ministros"."evento_escala_id" IN ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36, $37, $38, $39, $40, $41, $42, $43, $44, $45, $46, $47, $48, $49, $50, $51, $52, $53, $54, $55, $56, $57, $58, $59, $60, $61, $62, $63, $64, $65, $66, $67, $68, $69, $70, $71, $72, $73)
---
    def show
      @eventos = @competencia.evento_escalas.includes(:tipo_servico, :sacerdote, :ministros)

      @eventos = @eventos.where(tipo_servico_id: params[:tipo_servico_id]) if params[:tipo_servico_id].present?
      @eventos = @eventos.where(sacerdote_id: params[:sacerdote_id]) if params[:sacerdote_id].present?
      @eventos = @eventos.joins(:escala_ministros).where(escala_ministros: { ministro_id: params[:ministro_id] }).distinct if params[:ministro_id].present?

INSERT INTO "competencia_mensal" ("ano", "mes", "escala_gerada", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ano", 2026], ["mes", 3], ["escala_gerada", false], ["created_at", "2026-03-20 22:51:13.318257"], ["updated_at", "2026-03-20 22:51:13.318257"]]
---
    def create
      @competencia = CompetenciaMensal.new(competencia_params)
      if @competencia.save

SELECT "competencia_mensal".* FROM "competencia_mensal" WHERE "competencia_mensal"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_competencia
      @competencia = CompetenciaMensal.find(params[:id])