app/controllers/admin/competencia_mensal_controller.rb

    def show
      @tem_eventos_na_competencia = @competencia.evento_escalas.exists?

      unless @tem_eventos_na_competencia
        @eventos_contagem = 0
        @eventos_lista = []
        @eventos_calendario_loaded = []
        assign_tabs_and_periodo!
        return
      end

      @eventos = @competencia.evento_escalas.includes(:tipo_servico, :sacerdote, escala_ministros: :ministro)

      @eventos = @eventos.where(tipo_servico_id: params[:tipo_servico_id]) if params[:tipo_servico_id].present?
      @eventos = @eventos.where(sacerdote_id: params[:sacerdote_id]) if params[:sacerdote_id].present?
      if params[:ministro_id].present?
        @eventos = @eventos.where(id: escala_ministro_evento_ids_para_filtro(params[:ministro_id]))
---
SELECT "evento_escala".* FROM "evento_escala" WHERE "evento_escala"."competencia_mensal_id" = $1  [["competencia_mensal_id", 1]]