app/controllers/admin/equipes_controller.rb

    def index
      @equipes = Equipe.order(:nome)
---
SELECT "equipes".* FROM "equipes" ORDER BY "equipes"."nome" ASC

    def set_equipe
      @equipe = Equipe.find(params[:id])
---
SELECT "equipes".* FROM "equipes" WHERE "equipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]