app/controllers/admin/eventos_extra_controller.rb

SELECT "competencia_mensal".* FROM "competencia_mensal" WHERE "competencia_mensal"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def new
      data = params[:data].presence&.then { |d| Date.parse(d) } || Date.current
      competencia = params[:competencia_mensal_id].present? ? CompetenciaMensal.find_by(id: params[:competencia_mensal_id]) : competencia_mensal_atual

INSERT INTO "evento_escala" ("competencia_mensal_id", "tipo_servico_id", "data", "horario", "quantidade_ministros", "local", "descricao", "observacoes", "sacerdote_id", "valor_esportula", "equipe_id", "tipo_escala", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
---
    def create
      @evento = EventoEscala.new(evento_params.merge(tipo_escala: "extra"))
      if @evento.save

SELECT "evento_escala".* FROM "evento_escala" WHERE "evento_escala"."id" = $1 LIMIT $2  [["id", 361], ["LIMIT", 1]]
---
    def set_evento
      @evento = EventoEscala.find(params[:id])