app/controllers/admin/evento_escala_controller.rb

SELECT "evento_escala".* FROM "evento_escala" WHERE "evento_escala"."id" = $1 LIMIT $2  [["id", 294], ["LIMIT", 1]]
---
    def set_evento
      @evento = EventoEscala.find(params[:id])

SELECT "competencia_mensal".* FROM "competencia_mensal" WHERE "competencia_mensal"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_competencia
      @competencia = CompetenciaMensal.find(params[:competencia_mensal_id])