app/controllers/admin/ministros_controller.rb

SELECT "ministros".* FROM "ministros" ORDER BY "ministros"."nome" ASC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
      @ministros = Ministro.ordenados_por_nome.page(params[:page])

SELECT "ministros".* FROM "ministros" WHERE "ministros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_ministro
      @ministro = Ministro.find(params[:id])