app/controllers/admin/registros_esportula_controller.rb

SELECT "registro_esportulas".* FROM "registro_esportulas" ORDER BY "registro_esportulas"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
      @registros = RegistroEsportula.includes(:sacerdote).order(created_at: :desc).page(params[:page])