app/controllers/admin/sacerdotes_controller.rb

SELECT "sacerdotes".* FROM "sacerdotes" ORDER BY "sacerdotes"."nome" ASC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
      @sacerdotes = Sacerdote.ordenados_por_nome.page(params[:page])

INSERT INTO "sacerdotes" ("nome", "email", "telefone", "forma_esportula", "valor_esportula_padrao", "ativo", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      @sacerdote = Sacerdote.new(sacerdote_params)
      if @sacerdote.save

UPDATE "sacerdotes" SET "nome" = $1, "email" = $2, "forma_esportula" = $3, "valor_esportula_padrao" = $4, "updated_at" = $5 WHERE "sacerdotes"."id" = $6  [["nome", "Pe. Watson"], ["email", ""], ["forma_esportula", "por_missa"], ["valor_esportula_padrao", "200.0"], ["updated_at", "2026-03-19 23:20:24.768779"], ["id", 2]]
---
    def update
      if @sacerdote.update(sacerdote_params)

SELECT "sacerdotes".* FROM "sacerdotes" WHERE "sacerdotes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_sacerdote
      @sacerdote = Sacerdote.find(params[:id])