app/controllers/admin/tipo_servicos_controller.rb

SELECT "tipo_servicos".* FROM "tipo_servicos" ORDER BY "tipo_servicos"."tipo_escala" ASC, "tipo_servicos"."nome" ASC LIMIT $1 OFFSET $2  [["LIMIT", 25], ["OFFSET", 0]]
---
    def index
      @tipo_servicos = TipoServico.order(:tipo_escala, :nome).page(params[:page])