app/views/admin/dashboard/index.html.erb

SELECT COUNT(*) FROM "ministros" WHERE "ministros"."ativo" = $1  [["ativo", true]]
---
      <p class="text-sm text-stone-500">Ministros ativos</p>
      <p class="text-2xl font-semibold text-stone-800 mt-1"><%= Ministro.ativos.count %></p>

SELECT COUNT(*) FROM "sacerdotes" WHERE "sacerdotes"."ativo" = $1  [["ativo", true]]
---
      <p class="text-sm text-stone-500">Sacerdotes ativos</p>
      <p class="text-2xl font-semibold text-stone-800 mt-1"><%= Sacerdote.ativos.count %></p>

SELECT COUNT(*) FROM "tipo_servicos" WHERE "tipo_servicos"."ativo" = $1  [["ativo", true]]
---
      <p class="text-sm text-stone-500">Tipos de serviço</p>
      <p class="text-2xl font-semibold text-stone-800 mt-1"><%= TipoServico.ativos.count %></p>