app/views/admin/competencia_mensal/show.html.erb


    <% if @competencia.evento_escalas.any? %>
---
SELECT 1 AS one FROM "evento_escala" WHERE "evento_escala"."competencia_mensal_id" = $1 LIMIT $2  [["competencia_mensal_id", 2], ["LIMIT", 1]]
SELECT "evento_escala".* FROM "evento_escala" WHERE "evento_escala"."competencia_mensal_id" = $1  [["competencia_mensal_id", 1]]