app/views/admin/competencia_mensal/show.html.erb


    <% if @competencia.evento_escalas.any? %>
---
SELECT "evento_escala".* FROM "evento_escala" WHERE "evento_escala"."competencia_mensal_id" = $1  [["competencia_mensal_id", 2]]
SELECT COUNT(*) FROM "evento_escala" WHERE "evento_escala"."competencia_mensal_id" = $1  [["competencia_mensal_id", 2]]

                      <%= link_to admin_evento_escala_path(ev, filtros), data: { turbo_frame: "evento_modal" }, title: "Ver detalhes", class: "block text-[10px] sm:text-xs py-0.5 sm:py-1 px-1.5 sm:px-2 rounded mb-0.5 truncate border transition-colors hover:opacity-90 cursor-pointer", style: "background-color: #{cor}26; border-color: #{cor}; color: #1f2937;" do %>
                        <%= l(ev.horario, format: :time) %> <%= ev.tipo_servico.nome %><%= " - #{ev.sacerdote.nome}" if ev.tipo_servico.nome.downcase.include?("missa") && ev.sacerdote.present? %>
---
SELECT "sacerdotes".* FROM "sacerdotes" WHERE "sacerdotes"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 1], ["id", 2], ["id", 6], ["id", 7], ["id", 3], ["id", 5]]