app/views/admin/ministros/show.html.erb

                  <td class="px-4 py-3 text-right">
                    <% em = evento.escala_ministros.find { |x| x.ministro_id == @ministro.id } %>
---
SELECT "ministros".* FROM "ministros" WHERE "ministros"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]